---
layout: ../../../layouts/wiki/ArticleLayout.astro
title: ポートフォリオに思想を込めろ
description:
tag: column
author: Hiroaki So
---

デザイナー求人に応募してくださった方々のポートフォリオを拝見していて、その方の思想が見えないと、私は少し残念な気持ちになります。

もちろん「思想が見えない」というだけの理由で即お断りするわけではありませんが、どうしても、大きな加点ポイントを無得点で通過したような感じにはなってしまいます。

私は、デザイナーの思想が、人間性が、知りたいのです。

技術や経験が足りなくても、磨くことはできます。でも、数十年かけて培った思想は、そうそう変えられないものです。
同じ「世界がこうなったらサイコー」を持ってる人なら、現在の技術がどうであれ、きっと一緒に楽しく働けます。
でも、逆に技術があっても「世界がこうなったらサイコー」と思うものが違うなら、一緒に働くのは難しいでしょう。だって、目指すゴールが全然違うのですから。

私がいまの職場に応募したときのポートフォリオには、業務経験や制作物と同じくらい、自分の好きで得意なことや、その背景にある価値観について書きました。例を挙げると「情報を整理分類して分かりやすくすること」「分業と比較優位の考え方」「少ない公理で、多くの現象を説明できる体系」などです。

> もう ねぇねぇ 何見て
> 何聞いて幸せ？
> 話してみて すべてね
> （NiziU『Make you happy』より）

あなたはどんなデザイナー？
なぜ、デザインを仕事にしているの？
どういうものが好き？ どういうものが嫌い？
何してるときに一番アガる？ 何してるときに萎える？
この世界がどうなってほしい？ どこをどう変えたい？
どうなったらサイコーだと思う？

それを、ぜひポートフォリオで伝えてほしいのです。




