[
  {
    "label": "行政手続きの知識",
    "description": "SmartHR のコア機能である各種保険と行政手続きの正しい理解を有し、プロダクト開発に活用できること。",
    "levels": [
      "参考書の用語を理解できる。",
      "参考書を読みながら、行政手続きを行うことができる。また、相当の知識を持つ。",
      "年に1回以上実施する手続きについての知識が頭に入っており、独力で対応できる。",
      "レベル3相当の手続きの内容をメンバーに説明できる。また、利用頻度が少ない手続きについての知識もある。",
      "社労士相当の知識を持ち、業務を遂行できる。"
    ]
  },
  {
    "label": "給与計算および税制の知識",
    "description": "給与計算の基本的な業務と、給与計算にまつわる税制の正しい理解を有し、プロダクト開発に活用できること。",
    "levels": [
      "参考書の用語を理解できる",
      "参考書を読みながら、給与計算を行うことができる。また、相当の知識を持つ",
      "給与計算に加え、年末調整・地方税年度更新などの年次イベントについての知識が頭に入っており、独力で対応できる",
      "レベル3相当の手続きの内容をメンバーに説明できる。また、稀な事象についての知識もある。",
      "社労士・税理士相当の知識を持ち、業務を遂行できる"
    ]
  },
  {
    "label": "既存プロダクトの理解",
    "description": "SmartHR がすでにユーザーに提供しているプロダクトの機能・データ構造を理解し、改善できること。",
    "levels": [
      "いくつかの既存プロダクトの提供機能を網羅的に把握し、説明することができる。",
      "いくつかの既存プロダクトをリバースモデリングし、設計上・構造上の課題を改善することができる。",
      "多くの既存プロダクトの提供機能を網羅的に把握し、説明することができる。また、多くの既存プロダクトをリバースモデリングし、設計上・構造上の課題を改善することができる。",
      "すべての既存プロダクトの提供機能を網羅的に把握し、説明することができる。また、すべての既存プロダクトをリバースモデリングし、設計上・構造上の課題を改善することができる。",
      "すべての既存プロダクトでユーザーが抱える潜在的ニーズを正しく理解し、新しいビジネスインパクトを創出できる。"
    ]
  },
  {
    "label": "HTMLの理解",
    "description": "HTML に関する WHATWG 仕様（HTML Standard）等の正しい理解と、新しい規格等の情報収集能力を有すること。",
    "levels": [
      "HTML Standard の文法にのっとり、正しいマークアップができる。",
      "HTML Standard の仕様書の必要箇所を適切に探し、速やかに調べることができる。",
      "HTML Standard の仕様書を見なくてもほぼ仕様を述べることができる。",
      "HTML Standard の仕様書について他のメンバーへ解説・指導等が適切に行える。より新しい規格の仕様書等の必要箇所を適切に探し、速やかに調べることができる。",
      "より新しい規格の仕様書等についても精通している。"
    ]
  },
  {
    "label": "CSSの理解",
    "description": "CSS に関する W3C 仕様等の正しい理解と、新しい規格等の情報収集能力を有すること。",
    "levels": [
      "CSS の文法にのっとり、正しい記述ができる。",
      "CSS の仕様書の必要箇所を適切に探し、速やかに調べることができる。",
      "CSS の仕様書を見なくてもほぼ仕様を述べることができる。",
      "CSS の仕様書について他のメンバーへ解説・指導等が適切に行える。より新しい規格の仕様書等の必要箇所を適切に探し、速やかに調べることができる。",
      "より新しい規格の仕様書等についても精通している。"
    ]
  },
  {
    "label": "オブジェクトモデリングの理解",
    "description": "オブジェクトモデリングに関する UML 等の正しい理解と設計、実装を行う能力を有すること。",
    "levels": [
      "目的に応じたモデルを書ける",
      "UML の基本的表記法や型図などについて正しく理解して書ける。",
      "オブジェクトモデリングを最適な形で設計できる。これらについて指導できる。",
      "パターンやパターン・ランゲージを理解しており、要求汎用的なモデルとパターンを設計できる。",
      "オブジェクトモデリング業界においてエバンジェリストとして、特定の分野で標準になりうるようなモデルを設計できる。"
    ]
  },
  {
    "label": "ブラウザの理解",
    "description": "特に視覚的なブラウザの実装仕様やバグに関する知識やノウハウを有すること。",
    "levels": [
      "主要ブラウザについて、よく知られている固有の振る舞いを知っている。",
      "最適な形ではないにしろ、プロダクト要件を満たす記述ができる。",
      "HTML や CSS の仕様を理解したうえで前方互換・後方互換を考えた適切な記述ができる。",
      "世の中のブラウザの仕様やバグに精通しており、またいち早く察知できる。",
      "あらゆるブラウザの仕様やバグに精通しており、またそれらを回避する方法を知っている。"
    ]
  },
  {
    "label": "画面設計能力",
    "description": "要件を満たし、メンテナンス性やユーザビリティ、アクセシビリティを考慮した妥当な画面の設計や実装能力、またその速度を有すること。",
    "levels": [
      "仕様を理解し、それを反映した設計ができる。",
      "構造化された汎用性の高い設計ができる。",
      "要望・要求・要件を把握したうえで、将来的な拡張を見越したフレキシブルな設計ができる。",
      "画面設計手法自体を考案し、対外的にも有益な情報発信をしている。",
      "どのような要件のプロジェクトにおいても、常に拡張性があり最も効率的な設計手法を考案、実施することができる。"
    ]
  },
  {
    "label": "レガシー画面設計能力",
    "description": "件を満たし、メンテナンス性やユーザビリティ、アクセシビリティを考慮した妥当なレガシー画面の設計や実装能力、リバースエンジニアリング能力、またその速度を有すること。",
    "levels": [
      "レガシーな画面を解読し、当時の設計方針を読み取ることができる。またその方針に沿った設計を行うことができる。(改修できる)",
      "レガシーな画面の問題点を理解しており、その上で可能な限りユーザビリティとアクセシビリティを確保し、適切に構造化した設計ができる。",
      "モダンな設計とレガシーな設計が混在する場合に、互いに影響を及ぼさないような設計ができる。リバースエンジニアリングによりレガシーな環境を効率的にモダン環境に置き換えできる。",
      "レガシーな設計でモダンな設計の経験が多数あり、どちらの界隈にも一定以上名が知られている。",
      "神。レガシーな超巨大システムをモダンなシステムに置き換えた、あるいはプロジェクトを指揮した実績を持っている。"
    ]
  },
  {
    "label": "アクセシビリティの知識と理解",
    "description": "概要",
    "levels": [
      "基本的な考え方、基本となる事項を理解している。(例： なんとなく問題や意義はわかるが、具体的な指針を読んでいない)",
      "指針や仕様書の必要箇所を適切に探し、すみやかに調べる事ができる。",
      "個々の指針の内容を詳細に理解しており、アクセシビリティガイドラインの作成や監修を行うことができる。(例： 問題点をガイドラインのどこに記述するか検討し、実際に構成することができる)",
      "この分野について講演・執筆・受賞等の実績があり、社外に名が知られている。",
      "次期の指針策定に関わる立場にいる。"
    ]
  },
  {
    "label": "支援技術の知識と理解",
    "description": "主に音声ブラウザやその他の特殊なブラウザや支援技術の理解",
    "levels": [
      "どのようなブラウザが存在するのかを知っている。",
      "それらのブラウザのいくつかを実際に操作し、そのクセ等を理解している。",
      "それらのブラウザの多くを良く理解しており、それら全てにおいて問題が出ないような方策を考えることができる。",
      "この分野について講演・執筆・アクセシビリティサポーテッド情報公開等の実績があり、社外に名が知られている。",
      "このようなブラウザの作成に関わったり、アドバイスしたりする立場にいる。"
    ]
  },
  {
    "label": "ユーザーのモデル化に関する実践能力",
    "description": "ユーザーの利用状況やメンタルモデルに関する関連学問の知識を有する。",
    "levels": [
      "ユーザーの利用状況やメンタルモデルに関する関連学問の知識を有する。",
      "ユーザー調査等から得られた定量データ・定性データから、ユーザーの利用状況やメンタルモデルを理解し明文化できる。",
      "ユーザーの利用状況/メンタルモデルを踏まえたユーザーのモデル化に必要な手法を自ら提案し、周りを指導しながら主導的に実践できる。またその結果を周囲が理解できるように共有できる。",
      "実践事例を論文等にまとめて関連学会や団体に貢献している。",
      "関連学会における第一人者の立場にいる。"
    ]
  },
  {
    "label": "全体調整能力",
    "description": "施策を実行・状態管理するための能力",
    "levels": [
      "epicレベルの施策を開発者と連携して実行できる。",
      "新規プロダクト開発レベルの施策を開発者と連携して実現できる。",
      "開発者およびその他プロジェクト関係者と連携してプロダクトの運用体制をマネジメントできる。",
      "複数のプロダクトの運用・生産を支える体制基盤をマネジメントできる。",
      "経営レベルでのプロダクト生産体制をマネジメントができる。"
    ]
  },
  {
    "label": "ファシリテーション能力",
    "description": "コミュニケーションを効率的にし、合意形成や相互理解を高めて組織の業務遂行力を高める能力",
    "levels": [
      "z",
      "ファシリテーションの役割を理解し、進行役として役割を遂行できる。",
      "ファシリテーションの役割を遂行でき、場を効率的に進行させる事ができる。",
      "どんな場の乱れも整え、自身が場の内容に干渉せずに相互理解と合意形成を促せる。",
      "ファシリテーターとしての確固たる地位を持つ第一人者。"
    ]
  },
  {
    "label": "ビジュアルデザインの知識と理解",
    "description": "",
    "levels": [
      "色、タイポグラフィ、形、等の基礎的な知識を持ち合わせている",
      "ゲシュタルト原則、アフォーダンス、シグニファイア等の認知心理学の分野の基礎を理解し、理想の体験から導き出されたビジュアルデザインを提示出来る",
      "業種やデバイス、ビジネス要件やプロダクトの世界観問わず、適切なビジュアルデザインを提示することが出来る",
      "ビジュアルデザインやその背景にある思想を高い言語能力で言語化することが出来る",
      "ビジュアルデザインにおいて新しい表現方法を生み出し、それに対するユーザーのメンタルモデルを獲得することが出来る"
    ]
  },
  {
    "label": "デザインツールの知識",
    "description": "クライアント側での制作・展開・運用に対しての制作効率向上を目的とした デザインツールを使用、運用、選定、提案できる能力。",
    "levels": [
      "メインツール(Sketch) の基本概念を理解し、効率的な作業ができる。協働作業のための機能を理解し、使いこなすことができる。",
      "Abstract の基本概念と機能を理解して、プロジェクトやブランチの管理が出来る。",
      "日々更新されるデザインツールの仕様に準拠し、デザインファイルのレイヤー構造をより良く、適切なものに変更することができる。",
      "UIデザインのツールだけではなく、プロトタイピング用のツールやモーショングラフィックス用のツールを駆使し、制作効率の向上に貢献している。",
      "エクステンションなどを作成して根本的な機能拡張を行うことができる。"
    ]
  },
  {
    "label": "プロトタイピング能力",
    "description": "",
    "levels": [
      "与えられた仕様を基に複数回、プロダクトのプロトタイプを作成することができる（精度は問わない）。",
      "与えられた仕様を実製品の近い精度まで複数回に渡りプロダクトのプロトタイプを作成することができる。",
      "作成したプロトタイプを基に課題を発見することができる。",
      "作成したプロトタイプを基に課題を発見し、解決策を提示し実製品に近い精度まで複数回に渡りプロダクトのプロトタイプを作成することができる。",
      "標準のプロトタイピングの方法に加え、要件から新しいプロトタイピングの方法を開発することができる"
    ]
  },
  {
    "label": "ユーザビリティの知識と理解",
    "description": "ユーザビリティエンジニアリング原則の理解、ISO9241-11（ユーザーの行動と満足度の尺度の定義）の理解",
    "levels": [
      "どのような指針が存在するのかを、ある程度知っている。",
      "いくつかの指針や規格について、内容等を把握し、必要に応じて提案書類作成時にサポートができる。",
      "ユーザビリティ原則とISO9241-11の違いを正しく理解し、他のプロジェクトにアドバイスしたり、クライアントに対しても内容の解説をすることができる。",
      "この分野について講演・執筆・受賞等の実績があり、社外に名が知られている。",
      "次期の指針策定に関わる立場にいる。"
    ]
  },
  {
    "label": "ウェブクライアントサイドの設計能力",
    "description": "主に JavaScript で構築するクライアントサイドアプリケーションの開発要件を洗い出し、的確に設計する能力。",
    "levels": [
      "WebAPI、JavaScript、ブラウザ仕様などアプリケーション構築に必要な基本的知識を持っている。",
      "起票されたチケットや要件から要求仕様を理解して適切なアプリケーション設計に落とし込める。",
      "自らプロジェクトの要件仕様を定義し、アプリケーションの設計指針が立てられる。協業のための提案とメンバーに適切な指導ができる。",
      "クライアントサイドアプリケーションの第一人者で、WEBクライアントサイド APIの仕様設計などに携わっている。",
      "業界を震撼させる設計思想や手法を打ち出すことができる。"
    ]
  },
  {
    "label": "HCD/UXDの知識と理解 as UXD",
    "description": "ユーザーエクスペリエンスに対する基本的な知識と、ISO 9241-210:2010 あるいは JIS Z 8530：2019 に基づく人間中心設計プロセスの理解と手法の実践能力",
    "levels": [
      "ISO 9241-210:2010 あるいは JIS Z 8530：2019 に基づく人間中心設計プロセスの知識がある。",
      "プロジェクトにおいて、指示された手法を実施できる（初学者以上の質を期待）",
      "プロジェクトとHCDプロセスを紐付けて、プロジェクトを促進するために必要な手法を自ら提案し、周りを指導しながら主導的に実践できる。またその結果を周囲が理解できるように共有できる。",
      "実践事例を論文等にまとめて関連学会や団体に貢献している。",
      "ISO や JIS 規格の次版の策定に関わる立場にいる。"
    ]
  },
  {
    "label": "戦略課題分析および立案能力",
    "description": "事業成長のために「売れる」機能、「売れる」プロダクトの企画・立案する能力",
    "levels": [
      "事業戦略に基づいたepicを企画・立案できる（売り上げに繋がる機能を企画・立案できる）。",
      "事業戦略に基づいたプロダクトの企画・立案できる。",
      "単体プロダクトで中長期の事業戦略を立案できる。",
      "複数プロダクトを関連させて相乗効果を発揮する事業戦略を立案できる。",
      "会社経営レベルでの戦略立案ができる。"
    ]
  },
  {
    "label": "ユーザー調査の知識と実施能力",
    "description": "対象のユーザーから目的の情報を引き出すための調査設計の立案、手法の適切な選択、設計した内容の正しい実施、調査結果を正しく評価できる能力。",
    "levels": [
      "代表的な手法の知識と設計、実施、評価の流れを理解している。",
      "調査の目的を満たせるだけの設計、実施、評価を行うことができる.",
      "プロジェクトのメンバーを巻き込みながら調査が実施でき、結果を定性・定量データと合わせて評価し、理解できるように共有できる。",
      "実践事例等、論文書いて学会に貢献している。",
      "関連学会における第一人者の立場にいる。"
    ]
  },
  {
    "label": "ユーザビリティ評価やユーザーテスト実施能力",
    "description": "ISO 9241-11または、ISO 9126の理解があり、評価する対象のユーザー、状況、目的を明確に設計し、実施した結果から課題になっている原因を特定でき改善案を提案できる能力",
    "levels": [
      "ユーザビリティ評価における知識とユーザーテストの実施の流れを把握している。",
      "計画を設計して実施した結果から課題点と改善案を提案できる。",
      "プロジェクトに合わせて最適な手法、設計を用いてプロジェクトのメンバーを巻き込みながら実施を主導できる。結果をメンバー以外にも理解できるように共有できる。",
      "講演・執筆を行い、社外に名が知られている。",
      "関連学会における第一人者の立場にいる。"
    ]
  },
  {
    "label": "ユーザーの利用状況やメンタルモデルに関する知識と理解",
    "description": "ユーザーを理解する上で必要となる、ユーザーの利用状況やメンタルモデルに対する理解やユーザーのモデル化に関する実践能力",
    "levels": [
      "ユーザーの利用状況やメンタルモデルに関する関連学問の知識を有する。",
      "ユーザー調査等から得られた定量データ・定性データから、ユーザーの利用状況やメンタルモデルを理解し明文化できる。",
      "ユーザーの利用状況/メンタルモデルを踏まえたユーザーのモデル化に必要な手法を自ら提案し、周りを指導しながら主導的に実践できる。またその結果を周囲が理解できるように共有できる。",
      "実践事例を論文等にまとめて関連学会や団体に貢献している。",
      "関連学会における第一人者の立場にいる。"
    ]
  },
  {
    "label": "全体調整能力",
    "description": "施策を実行・状態管理するための能力",
    "levels": [
      "epicレベルの施策を開発者と連携して実行できる。",
      "新規プロダクト開発レベルの施策を開発者と連携して実現できる。",
      "開発者およびその他プロジェクト関係者と連携してプロダクトの運用体制をマネジメントできる。",
      "複数のプロダクトの運用・生産を支える体制基盤をマネジメントできる。",
      "経営レベルでのプロダクト生産体制をマネジメントができる。"
    ]
  },
  {
    "label": "QA能力",
    "description": "コード品質や表示品質の検証能力や検証精度に関する能力、検証プロセス設計力、テストの自動化技術。",
    "levels": [
      "指示された検証作業を過不足なく行うことができ、チェックの内容とその結果を指示された形で報告できる。",
      "QAの役割を理解し、文法チェックやクロスブラウザでの表示チェックを行うことができる。",
      "ドメインを理解し、プロジェクト要件に適した検証計画を立てて、それをチームで遂行することができる。",
      "PM的な観点とエンジニアの知識と技術を持ち、正確なテストと適切なテストフローを設計できる。",
      "QAの神。"
    ]
  }
]
